Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/coming_to_live_in_ireland/irish_citizens_coming_or_returning_to_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Irish citizens coming or returning to Ireland
ga: Saoránaigh Éireannacha ag teacht nó ag filleadh go hÉirinn

source: If you are an Irish citizen living outside Ireland and you are planning to live in Ireland, this document is an overview of what is involved in moving here
ga: Más saoránach Éireannach thú atá i do chónaí lasmuigh d'Éire tú ag beartú cónaí in Éirinn, is forbhreathnú é an doiciméad seo maidir leis an méid atá i gceist le bogadh anseo

source: You may be an Irish citizen born outside Ireland who is coming to live in Ireland for the first time, or you may be returning to Ireland after living and working abroad for a number of years. In both situations the information about your rights and entitlements is the same
ga: Is féidir gur saoránach Éireannach thú a rugadh lasmuigh d'Éire atá ag teacht chun a bheith i do chónaí in Éirinn den chéad uair riamh, nó is féidir go bhfuil tú ag filleadh ar Éirinn i ndiaidh duit a bheith i do chónaí agus ag obair thar lear ar feadh roinnt blianta

source: Being an Irish citizen means you are recognised as an Irish national and a citizen of the European Union
ga: Tá an fhaisnéis a bhaineann le do chearta agus le do theidlíochtaí mar an gcéanna sa dá chás

source: If you were born abroad and your parents or grandparents were Irish, you may be entitled to be an Irish citizen by birth or descent
ga: Tá tuilleadh faisnéise ann do shaoránaigh Éireannacha atá níos sine inár ndoiciméad, Teacht ar Scor go hÉirinn

source: If you are returning to Ireland with an EEA spouse, civil partner, de facto partner or other family member, they may enter Ireland freely
ga: Mar shaoránach Éireannach tá raon leathan cearta agat lena n-áirítear an ceart dul go hÉirinn agus a bheith i do chónaí ann

source: They will need to apply for residency permission from the Irish immigration services
ga: Mar shaoránach Éireannach aithnítear thú mar náisiúnaí Éireannach agus mar shaoránach den Aontas Eorpach

source: They may also need to apply for a visa before coming to Ireland. You can find information about applying for residency permission on the Crosscare Migrant Project website
ga: Má rugadh thar lear thú agus go mba Éireannaigh iad do thuismitheoirí nó do sheantuismitheoirí, d'fhéadfá a bheith i dteideal bheith i do Shaoránach d'Éirinn ó bhreith nó ó ghinealach

source: You may find that housing is very expensive in Ireland, irrespective of whether you are thinking of renting or buying a home
ga: Is féidir go rithfidh sé leat go bhfuil tithíocht in Éirinn thar a bheith costasach, is cuma má tá tú ag machnamh ar theach a thógáil ar cíos nó a cheannach

source: If you want to buy a home you need to be aware of the price trends in Ireland, the process by which houses are bought and sold and the initial costs that are involved
ga: Má theastaíonn uait teach a cheannach caithfidh tú a bheith ar an eolas maidir le treochtaí praghais sa tír seo, an chaoi a dhéantar tithe a cheannach agus a dhíol mar aon leis na costais thosaigh a bhaineann leis

source: There are no restrictions on the purchase or rent of residential property or land
ga: Níl srianta ar bith ann maidir le maoin chónaitheach nó talamh a cheannach nó a fháil ar cíos

source: Rental accommodation comes in many forms including houses, flats and apartments
ga: Tá roinnt cineálacha cóiríochta ar cíos ann lena n-áirítear tithe agus árasáin éagsúla

source: You will need to know about renting a home
ga: Beidh ort eolas a fháil maidir le teach a thógáil ar cíos

source: The rights of tenants in Ireland do not include as much security of tenure as in other countries
ga: Ní an tslándáil tionachta chéanna san áireamh le cearta tionóntaí in Éirinn agus atá i dtíortha eile

source: If you are thinking of returning, Safe Home Ireland provides information, advice and support to Irish emigrants wishing to return or move to Ireland
ga: Má tá tú ag smaoineamh ar fhilleadh, soláthraíonn Teach Sábháilte in Éirinn faisnéis, comhairle agus tacaíocht d’eisimircigh Éireannaigh a bhfuil mian leo filleadh nó bogadh go hÉirinn

source: As an Irish citizen you do not need permission to work in Ireland
ga: Mar shaoránach Éireannach ní gá duit cead a fháil chun obair in Éirinn

source: There is information in our document, Finding a job in Ireland
ga: Tá faisnéis ann inár ndoiciméad, Post a fháil in Éirinn

source: Before you start work, you should apply for a Personal Public Service Number (PPS number) and find out about tax and starting work
ga: Sula dtosaíonn tú ag obair, ba chóir duit iarratas a chur isteach ar Uimhir Phearsanta Seirbhíse Poiblí agus eolas a fháil maidir le cáin agus tosú ar obair

source: You can find information about employment rights and conditions such as minimum pay, leave and hours of work
ga: Is féidir leat eolas a fháil maidir le cearta agus coinníollacha oibre in Éirinn ar nós pá íosta, saoire agus uaireanta oibre

source: If you decide to work part-time, you can also find out about the employment rights of part-time workers
ga: Má shocraíonn tú obair ar bhonn páirt-aimseartha, is féidir leat eolas a fháil ar chearta fostaíochta fostaithe páirtaimseartha

source: If you intend to be self-employed there is information in our document on starting a business
ga: Má tá sé i gceist agat bheith féin-fhostaithe tá eolas ann inár ndoiciméad, Gnó a chur ar bun

source: If you are moving to Ireland you need to know about residency for tax purposes
ga: Má tá tú ag bogadh go hÉirinn caithfidh eolas a bheith agat maidir le cónaí chun críocha cánach

source: You will also be entitled to certain income tax credits and reliefs
ga: Beidh tú i dteideal creidmheasanna cánach agus faoiseamh ó cháin ioncaim a fháil

source: For example, tax relief is available for certain medical expenses
ga: Mar shampla, tá faoiseamh ó cháin ioncaim ar fáil ó chostais leighis áirithe

source: When you are opening a bank account in Ireland, you have to provide proof of your identity and of your address in Ireland
ga: Agus tú ag oscailt cuntas bainc in Éirinn, caithfidh tú cruthúnas maidir le d'fhéiniúlacht agus do sheoladh in Éirinn a sholáthar

source: If you are normally resident in Ireland, you are entitled to a range of health services that are either free of charge or subsidised by the Irish Government
ga: Má bhíonn tú i do chónaí in Éirinn de ghnáth, tá tú i dteideal raon seirbhísí sláinte atá saor in aisce nó á fhóirdheonú ag Rialtas na hÉireann

source: You are considered to be normally resident if you are planning to live in Ireland for a year or more
ga: Breithneofar tú a bheith i do ghnáthchónaitheoir má tá sé i gceist agat a bheith i gcónaí in Éirinn ar feadh bliana nó níos mó ná sin

source: Depending on your income, you may be eligible for a medical card which entitles you to certain health services at no cost
ga: Ag brath ar d'ioncam, is féidir leat a bheith incháilithe le haghaidh cárta liachta a thabharfadh teidlíocht duit seirbhísí sláinte áirithe a fháil gan costas

source: GP Visit Cards entitle you to free GP (family doctor) visits
ga: Tugann Cártaí Cuairte Dochtúra teidlíocht duit Seirbhísí dochtúra ginearálta (dochtúir teaghlaigh) a fháil saor in aisce

source: You will need to know how public health services are organised in Ireland
ga: Caithfidh sé a bheith ar eolas agat conas a eagraítear na seirbhísí sláinte in Éirinn

source: In addition to the public health system, people in Ireland can avail of a range of private health care services
ga: I dteannta leis an gcóras sláinte poiblí, tá raon seirbhísí cúraim sláinte príobháideacha ar fáil do dhaoine in Éirinn

source: You must pay the full costs of treatment if you opt for private health care
ga: Ní mór duit costais iomlána na cóireála a íoc má roghnaíonn tú cúram sláinte príobháideach

source: There are a number of private health insurance companies in Ireland
ga: Tá roinnt cuideachtaí árachais sláinte phríobháidigh in Éirinn

source: If you are moving to Ireland with your family you can find information about education in Ireland
ga: Má tá tú ag bogadh go hÉirinn le do theaghlach is féidir leat faisnéis a fháil faoi oideachas in Éirinn

source: Children are entitled to free education in publicly funded primary and second-level schools
ga: Tá leanaí i dteideal oideachas a fháil saor in aisce i mbunscoileanna agus i meánscoileanna a mhaoinítear go poiblí

source: For pre-school children there is a range of childcare options
ga: I gcás leanaí réamhscoile tá raon roghanna cúraim leanaí ann

source: There is more information in our documents, Moving your child to primary school and Moving your child to secondary school
ga: Tá tuilleadh faisnéise ann inár ndoiciméid, Do pháiste a aistriú chuig bunscoil in Éirinn agus Do Pháiste a aistriú chuig Meánscoil Éireannach

source: You may be coming to study at a third-level institution in Ireland
ga: D'fhéadfadh go bhfuil tú ag teacht chun staidéar a dhéanamh in institiúid tríú leibhéal in Éirinn

source: To qualify for free third-level fees you must have been resident in Ireland or another EU country for 3 years
ga: D'fhonn cáiliú le haghaidh táillí tríú leibhéal saor in aisce ní foláir duit a bheith i do chónaí in Éirinn nó i dtír AE eile ar feadh 3 bliana

source: If your income is below a certain level you may be eligible for a student maintenance grant
ga: Má tá d'ioncam faoi bhun leibhéil áirithe is féidir go bhfuil tú incháilithe le haghaidh deontais chothabhála do mhic léinn

source: There may be some significant differences between the social security system here and the country where you live so it will be worthwhile familiarising yourself with any differences in advance
ga: D'fheadfadh roinnt éagsúlachtaí suntasacha a bheith ann idir an córas slándála sóisialaí atá anseo agus an tír ina bhfuil tú i do chónaí agus dá réir sin beidh sé fiúntach duit féin eolas a fháil ar na héagsúlachtaí roimh ré

source: You can find out more about moving to Ireland and your social security entitlements
ga: Is féidir leat eolas a fháil maidir le do chearta leasa shóisialta agus tú ag bogadh go hÉirinn

source: If you work in Ireland and pay at least one Class A PRSI contribution, your social insurance contributions paid in another EU/EEA country can help you qualify for a social insurance payment such as Illness Benefit or Jobseeker.s Benefit
ga: Má oibríonn tú in Éirinn agus má íocann tú ranníocaíocht ÁSPC Aicme A amháin ar a laghad, d'fhéadfadh do ranníocaíochtaí árachais shóisialta arna íoc i dtír eile de chuid an AE/LEE cúnamh a thabhairt duit cáiliú le haghaidh íocaíocht árachais shóisialta ar nós an tSochair Breoiteachta nó an tSochair Cuardaitheora Poist

source: You should bring a record of your social insurance contributions using forms E104 and U1 (formerly E301) which you can get from your local social security office
ga: Ba chóir duit taifead ar do ranníocaíochtaí árachais shóisialta a thabhairt leat ag úsáid foirmeacha E104 agus U1 (E301 roimhe seo), atá ar fáil ó d'oifig slándála sóisialaí áitiúil

source: If you have been getting unemployment benefit for 4 weeks, you may transfer it to Ireland for up to 3 months if you bring a completed form U2 (formerly E303)
ga: Má tá sochar dífhostaíochta á fháil agat ar feadh 4 seachtaine, is féidir leat é a aistriú go hÉirinn ar feadh tréimhse suas le 3 mhí má bheireann tú foirm chomhlánaithe U2 (E303 roimhe seo) leat

source: Certain other social security benefits from another European Economic Area (EEA) country or Switzerland may also be transferred to Ireland, but not means-tested payments
ga: Is féidir sochair slándála sóisialaí áirithe eile ó thír eile de chuid an Limistéir Eorpaigh Eacnamaíoch (LEE) nó ón Eilvéis a aistriú go hÉirinn, ach ní fédiir é seo a dhéanamh le híocaíochtaí de réir tástála acmhainne

source: The European Economic Area consists of the member states of the European Union, Norway, Iceland and Liechtenstein
ga: Is éard atá sa Limistéar Eorpach Eacnamaíoch ná ballstáit an Aontais Eorpaigh, an tIorua, an

source: You should check with the social security agency in the country where you live
ga: Íoslainn agus an Lichtinstéin

source: You can find out more in our document, Combining social insurance contributions from abroad
ga: Ba chóir duit seiceáil a dhéanamh leis an ngníomhaireacht slándála sóisialaí sa tír ina bhfuil tú i do chónaí

source: If you do not have enough social insurance (PRSI) contributions you may qualify for a means-tested payment such as Jobseeker's Allowance
ga: Má tá tú i do chónaí lasmuigh den LEE ba chóir duit a fháil amach an bhfuil Comhaontú déthaobhach slándála sóisialaí idir Éire agus an tír a bhfuil tú ag fágáil ós rud go ligfeadh sé seo go dtabharfaí do ranníocaíochtaí árachais shóisialta san áireamh don phinsean Stáit ranníocach

source: You should know that there is a residency requirement to qualify for social assistance payments in Ireland
ga: Is féidir leat tuilleadh eolais a fháil inár ndoiciméad, Ranníocaíochtaí árachais shóisialta ón choigríoch a chomhcheangal

source: Returning emigrants should be aware that the conditions governing any possibility to transfer or access pension savings established in a jurisdiction outside of Ireland will be determined primarily by the rules and regulations applying to pension transfers in that jurisdiction
ga: Mura bhfuil go leor raníocaíochtaí árachais shóisialta (ÁSPC) déanta agat is féidir go gcáileoidh tú le haghaidh íocaíocht de réir tástála acmhainne ar nós Liúntas Cuardaitheora Poist

source: These rules and regulations differ significantly from country to country and may be influenced by a wide range of factors
ga: Ba chóir é a bheith ar eolas agat go bhfuil riachtanas cónaitheachta ann chun cáiliú le haghaidh íocaíochtaí cúnaimh shóisialaigh in Éirinn

source: Driving, cars and transport
ga: Tiomáin, gluaisteáin agus iompar

source: Full driving licences from all other EU member states (and some other countries) are recognised for use in Ireland
ga: Aithnítear láncheadúnais tiomána ó gach ballstát eile de chuid an AE (agus ó roinnt tíortha eile) lena n-úsáid in Éirinn

source: It may be possible to convert your driving licence to an Irish one
ga: D'fhéadfadh sé a bheith indéanta do cheadúnas tiomána a athrú go ceann Éireannach

source: If you want to bring your car to Ireland you need to know about importing a car and implications for Vehicle Registration Tax (VRT)
ga: Má theastaíonn uait do ghluaisteán a thabhairt leat go hÉirinn caithfidh eolas a bheith agat maidir le allmhairiú gluaisteán agus maidir le himpleachtaí na Cánach Cláraithe Feithiclí (VRT)

source: Information is available about public transport services in Ireland
ga: Tá faisnéis ar fáil maidir le seirbhísí iompair phoiblí in Éirinn

source: If you are over 66 and living permanently in Ireland, you are entitled to free travel on public bus and rail transport
ga: Má tá tú níos sine ná 66 agus i do chónaí ar bhonn buan in Éirinn, tá sé de theideal agat taisteal saor in aisce ar iompar poiblí bus agus iarnróid

source: Other issues for people moving to Ireland
ga: Saincheisteanna do dhaoine atá ag bogadh go hÉirinn

source: There are strict regulations about importing pets from abroad, so you need find out about the procedures for bringing your pet to Ireland
ga: Tá rialacháin dhochta ann maidir le peataí a allmhairiú ón iasacht, agus dá réir sin beidh fiosrú a dhéanamh i dtaobh na nósanna imeachta chun do pheata a thabhairt go hÉirinn

source: There are customs regulations about the importation of prohibited or restricted goods and Customs and Excise officers have the power to carry out searches of the baggage of people travelling to Ireland
ga: Tá rialacháin custaim maidir le hearraí coiscthe nó srianta a allmhairiú agus tá sé de chumhacht ag oifigigh Custaim agus Máil cuardaigh a dhéanamh ar bhagáiste dhaoine atá ag taisteal go hÉireann

source: Irish citizens living in Ireland have the right to vote in all elections and referenda
ga: Tá ceart chun vótáil i ngach toghchán agus reifreann ag saoránaigh Éireannacha atá ina gcónaí in Éirinn

source: Inforder to vote you must be on the Electoral Register
ga: D'fhonn vóta a chaitheamh caithfidh tú a bheith ar an gClár Toghthóirí

source: You may be interested to learn about the political system at national level and the political system at local level
ga: B'fhéidir go mbeadh suim agat foghlaim faoin gcóras polaitíochta ag leibhéal náisiúnta agus faoin gcóras polaitíochta ag leibhéal áitiúil

source: If you are coming to live in Ireland for the first time you can check the livinginIreland.ie website
ga: Má tá tú ag teacht go hÉirinn chun a bheith i do chónaí den chéad uair riamh , tá láithreán gréasáin livinginireland.ie ann

source: If you are coming back to live in Ireland again you can download information on returning to Ireland
ga: Má tá tú ag teacht thar n-ais chun a bheith i do chónaí in Éirinn in athuair is féidir leat faisnéis faoi fhilleadh ar Éirinn a fháil

source: They have both been made available by the Crosscare Migrant Project
ga: Tá an dá rud curtha ar fáil ag Crosscare Migrant Project

source: This website, citizensinformation.ie, is a comprehensive source of information on public services in Ireland such as employment rights, health services, housing, social security entitlements and general information about moving to Ireland
ga: Is foinse chuimsitheach é an láithreán gréasáin seo, citizensinformation.ie, d'fhaisnéis ar sheirbhísí poiblí in Éirinn ar nós cearta fostaíochta, seirbhísí sláinte, tithíocht, teidlíochtaí slándála sóisialaí agus faisnéis ghinearálta maidir le bogadh go hÉirinn

source: Information is also available from the Citizens Information Phone Service or you can call in to a Citizens Information Centre (CIC) near you
ga: Tá faisnéis ar fáil chomh maith ón Seirbhís Teileafóin um Fhaisnéis do Shaoránaigh nó is féidir leat bualadh isteach ar an Ionad Faisnéise do Shaoránaigh (CIC) atá gar duit
